# # 1. Поработайте с переменными,
# создайте несколько,
# выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные,
# выведите на экран.
var1 = 'oleg'
var2 = 100
var3 = 3.14159

print(var1, var2, var3)

user_name = input('Введите ваше имя: ')
user_num = int(input('Введите любое целое число: '))
user_e = input('Помните чему равно число e? ')  # 2,71828  etc.

print(f'Ваше имя {user_name}, вы ввели чило {user_num}, Фрейд бы на это сказал... В прочем не важно, так как по вашему мнению число e равно {user_e}')